[
    {
      "title": "Instinctive protection",
      "description": "A natural defense mechanism that protects an organism from harm."
    },
    {
      "title": "Intangible asset",
      "description": "Something valuable that a company owns but that is not physical, such as a brand name or intellectual property."
    },
    {
      "title": "Intern",
      "description": "A student or trainee who works, sometimes without pay, at a company or organization to gain practical experience."
    },
    {
      "title": "Investigate",
      "description": "To examine something carefully, especially to discover the truth about it."
    },
    {
      "title": "Irrigation",
      "description": "The supply of water to land or crops to help growth."
    },
    {
      "title": "Jump on the bandwagon",
      "description": "To join an activity or movement that has become popular or successful."
    },
    {
      "title": "Jump to conclusions",
      "description": "To make a decision or judgment before having all the facts."
    },
    {
      "title": "Jury",
      "description": "A group of people, typically twelve, who are selected to hear evidence in a court of law and give a verdict."
    },
    {
      "title": "Keep someone in the loop",
      "description": "To keep someone informed about a process or situation."
    },
    {
      "title": "Kidnapping",
      "description": "Taking someone away illegally by force, typically for ransom or other unlawful purpose."
    },
    {
      "title": "Leave at the altar",
      "description": "To abandon someone at the last minute, especially just before a wedding."
    },
    {
      "title": "Let something down",
      "description": "To release or deflate something that was previously held up or inflated."
    },
    {
      "title": "Let something out",
      "description": "To allow something to escape or to make something larger."
    },
    {
      "title": "Liaison",
      "description": "A communication or cooperation that facilitates a close working relationship between people or organizations."
    },
    {
      "title": "License plate",
      "description": "A metal or plastic plate attached to a vehicle, bearing a unique alphanumeric code for identification."
    },
    {
      "title": "Lit",
      "description": "Full of energy, great, or exciting."
    },
    {
      "title": "Lovers' Lane",
      "description": "A secluded road or path, typically for romantic couples."
    },
    {
      "title": "Low-hanging fruit",
      "description": "Something that is easy to achieve or solve."
    },
    {
      "title": "Make a U-turn",
      "description": "To turn a vehicle around in the opposite direction, often used metaphorically for a complete change in opinion or policy."
    },
    {
      "title": "Make out",
      "description": "To manage to see, hear, or understand something with difficulty, or to engage in kissing and sexual activity."
    },
    {
      "title": "Master multitasker",
      "description": "Someone who is very good at doing many things at once."
    },
    {
      "title": "Maternal foresight",
      "description": "A mother's ability to anticipate future needs or problems and plan accordingly."
    },
    {
      "title": "Maternal instinct",
      "description": "A natural tendency for mothers to care for and protect their children."
    },
    {
      "title": "Mean business",
      "description": "To be serious and determined about something."
    },
    {
      "title": "Memory keeper",
      "description": "A person or thing that preserves or records memories."
    }
  ]